package lesson17;

/**
 * TODO
 *  Написать консольную игру камень ножницы бумага
 *  - пользователь должен выбирать количество игр и ввести свое имя
 *  - пользователь должен иметь возможность прервать игру
 *  - после прекращения игры пользователь должен увидеть результат
 *  - результат надо сохранить в файл - https://www.baeldung.com/java-write-to-file
 *  (если файла нет его надо создать, если файл есть то дописать результат в файл) - формат записи выбрать самому
 */

public class Main {
    public static void main(String[] args) {

    }
}
